<!DOCTYPE html>
<html>
  <head>
	<meta charset="utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>
      Chaufferie
    </title>
  </head>
  <body>
    <link rel="stylesheet" href="../css/boilerroom.css">
    <link rel="stylesheet" href="../css/nav.css">
	<link rel="stylesheet" href="../css/footer.css">
	<script src="nav.js"></script>

	<nav>
		<div id="myNav" class="overlay">
			<a href="javascript:void(0)" class="closebtn" onclick="closeNav()">&times;</a>
			<div class="overlay-content">
			  <a href="index-fr.html">Page d&rsquo;accueil</a>
			  <a href="bathhouse-fr.html">Maison de bain</a>
			  <a href="spirits-fr.html">Yunas</a>
			  <a href="crc-fr.html">Invicta 2021</a>
			  <a href="boilerroom-fr.html">Robot</a>
			  <a href="timeline-fr.html">Parcours</a>
			  <a href="zenibas-fr.html">Tr&eacute;sor de Zeniba</a>
		  <a href="../index.html">Anglais</a>
			</div>
		  </div>
		  <span style="font-size:30px;cursor:pointer" onclick="openNav()">&#9776;</span>
		</nav>

 <header>
	<h1>La Chaufferie</h1>
 </header>

  <section class="content">
	<p class="text">Dans la c&eacute;l&egrave;bre chaufferie de la maison de bain Marcy, vous serez initi&eacute;s &agrave; l&rsquo;&eacute;volution de notre robot. Notre &eacute;quipe, aussi puissante soit-elle, a d&ucirc; faire face &agrave; des d&eacute;fis incroyablement difficiles, mais elle a r&eacute;ussi &agrave; construire son robot gr&acirc;ce &agrave; Invicta. </p>
	<img class="img-right" src="../images/boiler/b3.JPG" alt="Eugenia et Youanna travaillent sur le robot">
	<img class="img-left" src="../images/boiler/b9.JPG" alt="Theresa avec le robot">
	<h2 class="subheader">Le Robot</h2>
	<p class="text">Il est compos&eacute; de 2 principaux constituants. Le CRC duino est incrust&eacute; dans le constituant avec 4 roues omnidirectionnelles et contrôle le robot. Prolongement de la base, le bras a des paliers attach&eacute;s &agrave; l&rsquo;axe d&rsquo;acier et effectue des rotations gr&acirc;ce &agrave; un autre moteur qui est annex&eacute; &agrave; une grande roue omnidirectionnelle oppos&eacute;e pour permettre la rotation. Avec l&rsquo;extension faite de 2 r&eacute;guliers et un double t-slotted, les blocs pourront &ecirc;tre atteints.</p>
	<img class="img-left" src="../images/boiler/3d4.PNG" alt="Une vue du mod&egrave;le 3D du robot">
	<img class="img-right" src="../images/boiler/3d5.PNG" alt="Une vue de cot&eacute; du mod&egrave;le 3D du robot">
	<p class="text">Pour prendre les blocs, 2 moteurs sont attach&eacute;s &agrave; l&rsquo;axe gr&acirc;ce &agrave; de roues dent&eacute;es avec cha&icirc;nes. Afin de garder en place les formes g&eacute;om&eacute;triques, 7 roues de style acier ont &eacute;t&eacute; plac&eacute;es sur chacun des axes. De plus, des &eacute;lastiques ont &eacute;t&eacute; ajout&eacute;s cr&eacute;ant de la pression pour emp&ecirc;cher les blocs de tomber. Ce processus est r&eacute;p&eacute;t&eacute; jusqu&rsquo;&agrave; ce que la structure indiqu&eacute;e sur la carte de jeu soit compl&eacute;t&eacute;e. Finalement, le robot recule de la structure tout en la lib&eacute;rant. Une fois que la structure est achev&eacute;e, un sixi&egrave;me moteur annex&eacute; &agrave; un tube fait de flexible plexiglas contenant la balle va le faire effectuer une rotation sur son axe pour faire tomber la balle dans le cerceau. </p>
	<img class="img-left" src="../images/boiler/3d3.PNG" alt="Une vue de cot&eacute; du mod&egrave;le 3D du robot">
	<img class="img-right" src="../images/boiler/3d2.PNG" alt="Une vue d'avant du mod&egrave;le 3D du robot">
	<h2 class="subheader">Le Premier Pas</h2>
	<p class="text">Durant le mois de novembre, les Yunas constructrices ont commenc&eacute; la construction de leur premier prototype fait de carton. Gr&acirc;ce &agrave; leur tout nouveau prototype, elles avaient d&eacute;j&agrave; les id&eacute;es claires concernant leur robot. Ensuite, elles ont construit leur deuxi&egrave;me prototype mais, cette fois-ci, il &eacute;tait fait de plexiglass, d&rsquo;&eacute;lastiques, de bois, etc. Elles ont travaill&eacute; fort pour perfectionner leur deuxi&egrave;me prototype. Tranquillement, elles se rapprochent de leur projet final.</p>
	<img class="img-left" src="../images/boiler/b1.JPG" alt="Youanna travaille sur le robot">
	<video class="video" width="45%" height="440px" controls poster="../images/poster1-rob.png">
		<source src="../images/boiler/vid1.MOV" type="video/mp4">
			Votre navigateur ne prend pas en charge la balise vid&eacute;o.
	</video>
	<p class="text">De plus, elles ont fait plusieurs recherches pour que le robot puisse tourner. Au d&eacute;but, les Yunas avaient pr&eacute;vu de faire bouger le robot &agrave; partir de son centre, mais elles ont rapidement r&eacute;alis&eacute; que ce ne serait pas assez pr&eacute;cis et stable, alors elles ont d&eacute;cid&eacute; de changer de syst&egrave;me. L&rsquo;engin et le point de pivot pr&eacute;c&eacute;demment plac&eacute;s au centre du robot seront plutôt indirectement connect&eacute;s. En effet, le moteur sera d&eacute;plac&eacute; et indirectement connect&eacute; au milieu gr&acirc;ce au point du pivot. Durant leur travail, elles ont toujours gard&eacute; le m&ecirc;me squelette, mais elles ont d&ucirc; faire des changements au fur et &agrave; mesure que le projet avan&ccedil;ait pour r&eacute;parer les erreurs.
	</p>
	<h2 class="subheader">&lsquo;Je n&rsquo;ai besoin d&rsquo;aucune aide, cet endroit est plein de suie.&rsquo;</h2>
	<p class="text">Lorsque la comp&eacute;tition a &eacute;t&eacute; annonc&eacute;e, les Yunas programmeuses finissaient leurs recherches sur les diff&eacute;rents types de capteurs tels que les capteurs de couleur, de distance et plus encore. Elles se sont assur&eacute;es que tous les circuits fonctionnaient avec le CRC duino et les capteurs. N&rsquo;ayant pas tout le mat&eacute;riel n&eacute;cessaire, sans perdre de temps, elles ont commenc&eacute; la programmation du robot tout en continuant la r&eacute;solution de probl&egrave;mes de programmation qui avaient &eacute;t&eacute; donn&eacute;s &agrave; la comp&eacute;tition de l&rsquo;ann&eacute;e pr&eacute;c&eacute;dente.</p>
	<iframe class="model" src="https://marcelline5.autodesk360.com/shares/public/SH56a43QTfd62c1cd968d8c6244642be5a74?mode=embed" allowfullscreen="true" webkitallowfullscreen="true" mozallowfullscreen="true"  frameborder="0"></iframe>
	<p class="text">Lors du mois de d&eacute;cembre, les Yunas ont principalement cherch&eacute; des fa&ccedil; ons pour finaliser le prototype ainsi que pour cr&eacute;er un design pratique et compact, tout en discutant avec les Yunas programmeuses  pour arriver &agrave; programmer chacune des cartes de jeux s&eacute;par&eacute;ment. Un d&eacute;fi rencontr&eacute; d&egrave;s le d&eacute;but a &eacute;t&eacute; de perfectionner le m&eacute;canisme qui permet de prendre les pi&egrave;ces lors du jeu. Apr&egrave;s plusieurs tests, elles ont trouv&eacute; la meilleure solution et ont fait un remue-m&eacute;ninges d&rsquo;id&eacute;es pour trouver un moyen pour lancer la balle &agrave; la fin du jeu.</p>
	<img class="img-left" src="../images/boiler/b4.JPG" alt="Gulraaj et Youanna travaillent sur le robot">
	<img class="img-right" src="../images/boiler/b2.JPG" alt="Melody travaille sur le circuit du robot">
	<p class="text">Durant ce mois festif, les Yunas programmeuses ont continu&eacute; la r&eacute;solution des exercices de programmation, mais cette fois-ci, elles ont d&eacute;but&eacute; l&rsquo;analyse des codes plus en profondeur en les expliquant sur le tableau blanc de la salle. Tout allait bien jusqu&rsquo;&agrave; ce qu&rsquo;elles rencontrent leur premi&egrave;re emb&ucirc;che! Les Yunas avaient re&ccedil; u leur tout nouveau CRC duino, mais avaient de la difficult&eacute; &agrave; l&rsquo;utiliser. Tout de m&ecirc;me, apr&egrave;s quelques jours, elles ont repris les choses en main et ont poursuivi leur travail. Les programmeuses du robot ont converti les codes qu&rsquo;elles avaient et les ont convertis pour que ceux-ci soient compatibles avec le crc duino. Finalement, elles ont &eacute;crit le squelette durant le reste du mois de d&eacute;cembre.</p>
	<video width="100%" controls poster="../images/poster2-rob.png">
		<source src="../images/boiler/vid2.MP4" type="video/mp4">
			Votre navigateur ne prend pas en charge la balise vid&eacute;o.
	</video>
	<h2 class="subheader">Imbattables</h2>
	<p class="text">Ce robot a &eacute;galement beaucoup de restrictions qui devaient &ecirc;tre prises en compte, ce qui &eacute;tait en fait un gros d&eacute;fi pour notre &eacute;quipe. Par exemple, sa taille &eacute;tait un assez gros obstacle. Les filles ont d&ucirc; changer la disposition du robot pour le rendre plus compact et le m&eacute;canisme pour faire tomber la balle.  Elles ont d&ucirc; faire la m&ecirc;me chose pour sa conception. Le nombre de moteurs autoris&eacute; &eacute;tait &eacute;galement un d&eacute;fi, mais pas si grand pour notre &eacute;quipe. Pour y rem&eacute;dier, les filles ont trouv&eacute; un syst&egrave;me dot&eacute; de m&eacute;canismes qui fonctionnent plus efficacement et qui peuvent faire plus d&rsquo;une chose. Maintenant qu&rsquo;elles ont leur plan, elles doivent le perfectionner d&rsquo;ici la comp&eacute;tition.
	</p>
	<img class="img-left" src="../images/boiler/b6.JPG" alt="Youanna pr&eacute;sente le robot">
	<img class="img-right" src="../images/boiler/b7.JPG" alt="Melina et le robot">
	
  </section>
	
<section>  
<aside class="soot" style = "position:absolute; left:85%; top: 800px; z-index: -1">
  <img src="../tokens/soot1.PNG" height="200" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:3%; top: 1300px; z-index: -1">
  <img src="../tokens/soot2.PNG" height="200" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:84%; top: 1600px; z-index: -1">
	<img src="../tokens/soot3.PNG" height="150" alt="jeton de suie">
  </aside>
<aside class="soot" style = "position:absolute; left:3%; top: 2000px; z-index: -1">
  <img src="../tokens/soot4.PNG" height="150" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:84%; top: 2300px; z-index: -1">
	<img src="../tokens/soot2.PNG" height="200" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:3%; top: 2800px; z-index: -1">
	<img src="../tokens/soot1.PNG" height="200" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:85%; top: 3200px; z-index: -1">
	<img src="../tokens/soot4.PNG" height="150" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:3%; top: 3600px; z-index: -1">
	<img src="../tokens/soot3.PNG" height="150" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:85%; top: 4100px; z-index: -1">
	<img src="../tokens/soot1.PNG" height="200" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:3%; top: 4700px; z-index: -1">
	<img src="../tokens/soot2.PNG" height="200" alt="jeton de suie">
</aside>
<aside class="soot" style = "position:absolute; left:84%; top: 5300px; z-index: -1">
	<img src="../tokens/soot3.PNG" height="150" alt="jeton de suie">
</aside>
</section>

<footer>
    <p>Bas&eacute; sur Spirited Away de Studio Ghibli<br>
    Dessins par Melina Farahdel, Theresa Khoury, Victoria Hoang et Julianna Assaf-Fortin<br>
    Photos par Emily Hoang, Camille Jean-Fran&ccedil;ois et Catherine Louca<br>
    <br>
    <p>&copy; 2021 Robotique Marcelline</p>
  </footer>

</body>
</html>
