<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Journey</title>
	<link rel="stylesheet" href="../css/timeline.css" type="text/css">
</head>
<body>
	<link rel="stylesheet" href="../css/nav.css">
	<link rel="stylesheet" href="../css/footer.css">
	<script src="nav.js"></script>

	<nav>
	<div id="myNav" class="overlay">
		<a href="javascript:void(0)" class="closebtn" onclick="closeNav()">&times;</a>
		<div class="overlay-content">
		  <a href="index-fr.html">Page d&rsquo;accueil</a>
		  <a href="bathhouse-fr.html">Maison de bain</a>
		  <a href="spirits-fr.html">Yunas</a>
		  <a href="crc-fr.html">Invicta 2021</a>
		  <a href="boilerroom-fr.html">Robot</a>
		  <a href="timeline-fr.html">Parcours</a>
		  <a href="zenibas-fr.html">Tr&eacute;sor de Zeniba</a>
          <a href="../index.html">Anglais</a>
		</div>
	  </div>
	  <span style="font-size:30px;cursor:pointer" onclick="openNav()">&#9776;</span>
	</nav>
	
	<header>
		<h1>Notre Parcours</h1>
	</header>

	<section>	
	  <p class="timeline-text">Pendant le mois d&rsquo;avril, chaque &eacute;quipe de Yunas a travaill&eacute; dur, le d&eacute;but de la pand&eacute;mie ne nous a pas emp&ecirc;ch&eacute;es de faire avancer les choses.  
		  <br><br><img class="image-left" src="../images/timeline/t10.JPG" alt="Une rencontre avec toute l'&eacute;quipe">
		  <img class="image-right" src="../images/timeline/t9.JPG" alt="Youanna derri&egrave;re une partie du robot">
	  <p class="timeline-text">L&rsquo;&eacute;quipe de Yunas responsables du robot a commenc&eacute; &agrave; travailler sur le tutoriel et, en le faisant, elles ont &eacute;crit le sc&eacute;nario et l&rsquo;ont traduit en anglais et en fran&ccedil; ais. Elles ont aussi organis&eacute; les conceptions 3D en d&eacute;cidant le moment o&ugrave; elles appara&icirc;tront pour que l&rsquo;animation soit claire. D&rsquo;autre part, nos Yunas de la programmation ont eu, chaque semaine, une r&eacute;union pour pratiquer les probl&egrave;mes qui leur ont &eacute;t&eacute; donn&eacute;s pour la comp&eacute;tition. 
		<br>
		<video class="vid1" width="90%" controls poster="../images/poster1-journey.png">
			<source src="../images/timeline/prog-interview.mp4" type="video/mp4">
				Votre navigateur ne prend pas en charge la balise vid&eacute;o.
		</video>
		</p>
	  <p class="timeline-text">De leur côt&eacute;, les Yunas responsables du site web ont commenc&eacute; &agrave; organiser le site web que nous utiliserons pour la comp&eacute;tition. Les filles ont fait des remue-m&eacute;ninges et ont pris des d&eacute;cisions au sujet de quelques fonctionnalit&eacute;s du site web pour clairement savoir ce qu&rsquo;elles allaient faire au lancement de la comp&eacute;tition.
		<br>
		<img class="image-left" src="../images/timeline/3d.png" alt="L'&eacute;quipe des dessins 3D travaillent">
		<img class="image-right" src="../images/timeline/t13.jpeg" alt="L'&eacute;quipe de site web lors de la s&eacute;ance de photos">
		<br> De plus, au mois d&rsquo;avril et pendant tout l&rsquo;&eacute;t&eacute;, les Yunas en charge de la vid&eacute;o ont commenc&eacute; &agrave; &eacute;crire le sc&eacute;nario. Finalement, les Yunas s&rsquo;occupant des dessins 3D ont commenc&eacute; leur travail gr&acirc;ce au logiciel Inventor tout en apprenant comment animer les objets.
	</p>
	  <p class="timeline-text">Le mois de novembre a commenc&eacute; avec l&rsquo;annonce de la comp&eacute;tition CRC Invicta. Les Yunas ont pu mettre sur pied leur plan m&eacute;ticuleusement concoct&eacute; depuis l&rsquo;arriv&eacute;e de Yubaba.<br><br>
		Les Yunas s&rsquo;occupant du site web ont d&eacute;but&eacute; le plan pour sa construction. Il est primordial que le site web soit parfait, car il s&rsquo;agit de notre arme pour r&eacute;pandre les nouvelles! Au milieu du mois de novembre, elles ont finalement commenc&eacute; &agrave; ramasser les codes pour assurer sa construction. Page par page, le site web prenait enfin forme!
		<br><img class="image-left" src="../images/timeline/t4.JPEG" alt="L'&eacute;quipe de site web r&eacute;visent le site web">
		<img class="image-right" src="../images/timeline/t12.JPG" alt="L'&eacute;quipe de journalisme travaillent sur le contenu du site web">
		</p>
	  <p class="timeline-text">Les Yunas s&rsquo;occupant de la mod&eacute;lisation 3D ont travaill&eacute; &agrave; la conception du tutoriel &eacute;tant donn&eacute; sa longueur. Elles ont finalis&eacute; la premi&egrave;re version de la vid&eacute;o, mais elles ont des changements &agrave; effectuer pour la rendre plus attrayante. Ayant pris de l&rsquo;avance par rapport &agrave;  leur horaire , elles ont aid&eacute; d&rsquo;autres Yunas dans le besoin en dessinant le terrain de la comp&eacute;tition par exemple. 
		
	</p>
	  <p class="timeline-text"> Au mois de d&eacute;cembre, la cadence a augment&eacute;. Les Yunas, de plus en plus proches du jour «j», n&rsquo;ont pas baiss&eacute; les bras. 
		<br><img class="image-left" src="../images/timeline/t11.JPG" alt="L'&eacute;quipe de programmation discutent derri&egrave;re le circuit">
		<img class="image-right" src="../images/timeline/t3.jpeg" alt="L'&eacute;quipe de construction du robot travaillent">
		<br>Le tutoriel s&rsquo;est av&eacute;r&eacute; une t&acirc;che plus longue que pr&eacute;vue, mais les Yunas n&rsquo;ont pas abandonn&eacute;, elles ont continu&eacute; &agrave; le peaufiner.
	</p>
	<p class="timeline-text">La nouvelle &eacute;quipe a enfin d&eacute;but&eacute; sa partie du plan en commen&ccedil; ant &agrave; faire le sc&eacute;nario pour la vid&eacute;o. Il est important que la vid&eacute;o soit bien tourn&eacute;e, car elle servira &agrave; expliquer la situation aux Yunas qui ont perdu la m&eacute;moire. Vers la fin d&eacute;cembre, les filles ont commenc&eacute; &agrave; r&eacute;diger le sc&eacute;nario pour &ecirc;tre certaines de n&rsquo;oublier aucun d&eacute;tail important. Un de leurs plus grands d&eacute;fis &eacute;tait de s&rsquo;occuper de la vid&eacute;o en plus de leurs autres t&acirc;ches respectives.
		<br><img class="image-left" src="../images/timeline/t0.JPG" alt="Deux filles discutent de la vid&eacute;o">
		<img class="image-right" src="../images/timeline/t7.JPG" alt="L'&eacute;quipe de site web travaillent dans une classe">
	</p>
	<p class="timeline-text">Au commencement du mois de d&eacute;cembre, la CRC nous a contact&eacute; pour expliquer aux Yunas comment am&eacute;liorer le site web et bien s&rsquo;organiser. Suite &agrave; cette rencontre, les filles ont continu&eacute; la construction de chacune des pages. Les Yunas journalistes ont ramass&eacute; du contenu et ont &eacute;crit les textes. La configuration du site web n&rsquo;a cess&eacute; d&rsquo;&eacute;voluer pour finalement arriver &agrave; sa forme finale en fin d&eacute;cembre. Leur plus grand d&eacute;fi a &eacute;t&eacute; de bien distribuer les t&acirc;ches et le temps allou&eacute; pour s&rsquo;assurer de pouvoir terminer le site web. Les journalistes se sont occup&eacute;es de la configuration ainsi que du ramassage de contenu tandis que les codeuses ont continu&eacute; &agrave; apprendre de nouveaux codes pour s&rsquo;assurer de bien construire chacune des pages. Il fallait qu&rsquo;elles s&rsquo;assurent que chaque t&acirc;che soit bien effectu&eacute;e pour suivre le plan pour vaincre Yubaba.
		<br><video class="vid1" width="90%" controls poster="../images/poster1-journey.png">
			<source src="../images/timeline/webvid.MP4" type="video/mp4">
				Votre navigateur ne prend pas en charge la balise vid&eacute;o.
		</video>
	</p>
	<p class="timeline-text">Le 18 janvier, les Yunas ont &eacute;t&eacute; inform&eacute;es que la comp&eacute;tition a &eacute;t&eacute; repouss&eacute;e en avril. Elle aura lieu du 15 au 17 avril.  Les Yunas se sont vu accorder deux mois additionnels pour perfectionner leur travail.
	</p>
	<p class="timeline-text">En l&rsquo;espace de deux mois, des entrevues ont &eacute;t&eacute; donn&eacute;es. Ajouter des sous-titres aux vid&eacute;os a pris beaucoup plus de temps que pr&eacute;vu! De plus, la structure du site web &eacute;tait presque enti&egrave;rement finalis&eacute;e. 
		<br>
		<img class="image-left" src="../images/timeline/t6.JPEG" alt="Camille, journaliste, fait une entrevue avec les filles de programmation">
		<img class="image-right" src="../images/timeline/t5.JPG" alt="Sabrina et Camille, suite &agrave; la s&eacute;ance de photos">
		<br>L&rsquo;&eacute;quipe de dessin 3D a continu&eacute; &agrave; travailler sur les tutoriels. Les dessins et animations du robot ainsi que du terrain sont compl&eacute;t&eacute;s.
		<br><br>Avec la date de soumission approchant &agrave; grands pas, de petites touches ont &eacute;t&eacute; faites et la derni&egrave;re sc&egrave;ne a finalement &eacute;t&eacute; compl&eacute;t&eacute;e. 
		<br><br>Le site web a &eacute;t&eacute; raffin&eacute; et fin pr&ecirc;t &agrave; &ecirc;tre soumis.  
	</p>
</section>
<section>  
	<aside style = "position:absolute; left:85%; top: 400px; opacity: 1; z-index: -1">
	  <img class="train" src="../tokens/train1.PNG" height="600" alt="jeton d'un train">
	</aside>
	<aside style = "position:absolute; left:8%; top: 1000px; opacity: 1; z-index: -1">
	  <img class="train" src="../tokens/train2.PNG" height="600" alt="jeton d'un train">
	</aside>
	<aside style = "position:absolute; left:85%; top: 1700px; opacity: 1; z-index: -1">
	  <img class="train" src="../tokens/train3.PNG" height="600" alt="jeton d'un train">
	</aside>
	<aside style = "position:absolute; left:8%; top: 2400px; opacity: 1; z-index: -1">
		<img class="train" src="../tokens/train4.PNG" height="600" alt="jeton d'un train">
	</aside>
	<aside style = "position:absolute; left:85%; top: 3100px; opacity: 1; z-index: -1">
		<img class="train" src="../tokens/train1.PNG" height="600" alt="jeton d'un train">
	</aside>
	<aside style = "position:absolute; left:8%; top: 3900px; opacity: 1; z-index: -1">
		<img class="train" src="../tokens/train2.PNG" height="600" alt="jeton d'un train">
	</aside>
	</section>

	<footer>
		<p>Bas&eacute; sur Spirited Away de Studio Ghibli<br>
		Dessins par Melina Farahdel, Theresa Khoury, Victoria Hoang et Julianna Assaf-Fortin<br>
		Photos par Emily Hoang, Camille Jean-Fran&ccedil;ois et Catherine Louca<br>
		Frise chronologique par Jonathan Snook
		<br>
		<p>&copy; 2021 Robotique Marcelline</p>
	  </footer>

</body>
</html>














